linkShare2/app/views/links/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 14]]
---
<h2> Comment </h2>
<% @link.comments.each do |comment| %>