linkShare2/app/controllers/comments_controller.rb

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test comment"], ["link_id", 14], ["user_id", 13], ["created_at", "2022-07-29 19:07:04.434555"], ["updated_at", "2022-07-29 19:07:04.434555"]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save