linkShare2/app/controllers/links_controller.rb

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 12]]