linkShare2/app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Google"], ["url", "google.com"], ["created_at", "2022-08-03 16:06:38.714780"], ["updated_at", "2022-08-03 16:06:38.714780"], ["user_id", 15]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save