linkShare2/app/controllers/links_controller.rb

  def create
    # Modify
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "google"], ["url", "google.com"], ["created_at", "2022-07-29 16:18:25.114549"], ["updated_at", "2022-07-29 16:18:25.114549"], ["user_id", 5]]

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 6]]