pet_store/app/controllers/pets_controller.rb

  def index
    @pets = Pet.all
---
SELECT "pets".* FROM "pets"

  def show
    @pet = Pet.find(params[ :id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @pet = Pet.new(pet_params)

    if @pet.save
---
INSERT INTO "pets" ("name", "age", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "teddy"], ["age", "1"], ["price", nil], ["description", "loves to hug"], ["created_at", "2022-07-27 19:16:25.786476"], ["updated_at", "2022-07-27 19:16:25.786476"]]

  def update
    @pet = Pet.find(params[:id])

    if @pet.update(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "pets" SET "description" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["description", "Loves to play!"], ["updated_at", "2022-07-27 19:15:04.518726"], ["id", 3]]

  def destroy
    @pet = Pet.find(params[:id])
    @pet.destroy
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 15]]